In [3]:
import pandas as p

In [4]:
data = {
    "Names" : ['Shuban', 'Taimoor', 'Huzaifa', 'Hadia', 'Ali', 'Muneeb', 'Tuba', 'Warda'],
    "Age" : [19,20,18,21,22,20, 21, 22],
    "Salary" : [250000, 200000, 100000, 80000, 90000, 100000, 50000, 60000],
    "Performance" : [99,95,85,80,85,90,70,75]
}
df = p.DataFrame(data)
print(df)

# Adding col via assign
df["Destination"] = ['ML Engineer', 'CEO', 'COO', 'Software Engineer', 'Full Stack', 'Full Stack', 'Accountant', 'Human Resouce']
print("\n\n")
print(df)

# cal col
df["Bonus(10%)"] = df['Salary'] * 0.1
print("\n\n")
print(df.head(8))

     Names  Age  Salary  Performance
0   Shuban   19  250000           99
1  Taimoor   20  200000           95
2  Huzaifa   18  100000           85
3    Hadia   21   80000           80
4      Ali   22   90000           85
5   Muneeb   20  100000           90
6     Tuba   21   50000           70
7    Warda   22   60000           75



     Names  Age  Salary  Performance        Destination
0   Shuban   19  250000           99        ML Engineer
1  Taimoor   20  200000           95                CEO
2  Huzaifa   18  100000           85                COO
3    Hadia   21   80000           80  Software Engineer
4      Ali   22   90000           85         Full Stack
5   Muneeb   20  100000           90         Full Stack
6     Tuba   21   50000           70         Accountant
7    Warda   22   60000           75      Human Resouce



     Names  Age  Salary  Performance        Destination  Bonus(10%)
0   Shuban   19  250000           99        ML Engineer     25000.0
1  Taimoor   20  200000           95                CEO     20000.0
2  Huzaifa   18  100000           85                COO     10000.0
3    Hadia   21   80000           80  Software Engineer      8000.0
4      Ali   22   90000           85         Full Stack      9000.0
5   Muneeb   20  100000           90         Full Stack     10000.0
6     Tuba   21   50000           70         Accountant      5000.0
7    Warda   22   60000           75      Human Resouce      6000.0

In [5]:
# add using insert
# df.insert(loc, "Column Name", "Data")
df.insert(0,"Emp_ID", ["25-Alien-001","25-Alien-002","25-Alien-003","25-Alien-004","25-Alien-005", "25-Alien-006", "25-Alien-007", "25-Alien-008"])
print(df)

         Emp_ID    Names  Age  Salary  Performance        Destination  \
0  25-Alien-001   Shuban   19  250000           99        ML Engineer
1  25-Alien-002  Taimoor   20  200000           95                CEO
2  25-Alien-003  Huzaifa   18  100000           85                COO
3  25-Alien-004    Hadia   21   80000           80  Software Engineer
4  25-Alien-005      Ali   22   90000           85         Full Stack
5  25-Alien-006   Muneeb   20  100000           90         Full Stack
6  25-Alien-007     Tuba   21   50000           70         Accountant
7  25-Alien-008    Warda   22   60000           75      Human Resouce

   Bonus(10%)
0     25000.0
1     20000.0
2     10000.0
3      8000.0
4      9000.0
5     10000.0
6      5000.0
7      6000.0

In [6]:
# update salary of hadia
df.loc[3,"Salary"] = 120000
print(df)

         Emp_ID    Names  Age  Salary  Performance        Destination  \
0  25-Alien-001   Shuban   19  250000           99        ML Engineer
1  25-Alien-002  Taimoor   20  200000           95                CEO
2  25-Alien-003  Huzaifa   18  100000           85                COO
3  25-Alien-004    Hadia   21  120000           80  Software Engineer
4  25-Alien-005      Ali   22   90000           85         Full Stack
5  25-Alien-006   Muneeb   20  100000           90         Full Stack
6  25-Alien-007     Tuba   21   50000           70         Accountant
7  25-Alien-008    Warda   22   60000           75      Human Resouce

   Bonus(10%)
0     25000.0
1     20000.0
2     10000.0
3      8000.0
4      9000.0
5     10000.0
6      5000.0
7      6000.0

In [7]:
# increase salary 20% for each
df["Salary"] += df["Salary"]  * 0.2
print(df)

         Emp_ID    Names  Age    Salary  Performance        Destination  \
0  25-Alien-001   Shuban   19  300000.0           99        ML Engineer
1  25-Alien-002  Taimoor   20  240000.0           95                CEO
2  25-Alien-003  Huzaifa   18  120000.0           85                COO
3  25-Alien-004    Hadia   21  144000.0           80  Software Engineer
4  25-Alien-005      Ali   22  108000.0           85         Full Stack
5  25-Alien-006   Muneeb   20  120000.0           90         Full Stack
6  25-Alien-007     Tuba   21   60000.0           70         Accountant
7  25-Alien-008    Warda   22   72000.0           75      Human Resouce

   Bonus(10%)
0     25000.0
1     20000.0
2     10000.0
3      8000.0
4      9000.0
5     10000.0
6      5000.0
7      6000.0

In [8]:
## Remove columns
df.drop(columns=['Performance'], inplace=True)
print(df)

         Emp_ID    Names  Age    Salary        Destination  Bonus(10%)
0  25-Alien-001   Shuban   19  300000.0        ML Engineer     25000.0
1  25-Alien-002  Taimoor   20  240000.0                CEO     20000.0
2  25-Alien-003  Huzaifa   18  120000.0                COO     10000.0
3  25-Alien-004    Hadia   21  144000.0  Software Engineer      8000.0
4  25-Alien-005      Ali   22  108000.0         Full Stack      9000.0
5  25-Alien-006   Muneeb   20  120000.0         Full Stack     10000.0
6  25-Alien-007     Tuba   21   60000.0         Accountant      5000.0
7  25-Alien-008    Warda   22   72000.0      Human Resouce      6000.0

In [9]:
## Adding New row
df.loc[len(df)] = ["26-Alien-009", "Hamna", 22, 95000, "Finance", 9500]
print(df)

         Emp_ID    Names  Age    Salary        Destination  Bonus(10%)
0  25-Alien-001   Shuban   19  300000.0        ML Engineer     25000.0
1  25-Alien-002  Taimoor   20  240000.0                CEO     20000.0
2  25-Alien-003  Huzaifa   18  120000.0                COO     10000.0
3  25-Alien-004    Hadia   21  144000.0  Software Engineer      8000.0
4  25-Alien-005      Ali   22  108000.0         Full Stack      9000.0
5  25-Alien-006   Muneeb   20  120000.0         Full Stack     10000.0
6  25-Alien-007     Tuba   21   60000.0         Accountant      5000.0
7  25-Alien-008    Warda   22   72000.0      Human Resouce      6000.0
8  26-Alien-009    Hamna   22   95000.0            Finance      9500.0

In [10]:
## Adding New row
df.loc[len(df)] = ["26-Alien-010", "Amna", 22, 90000, "Finance", 9500]
print(df)

         Emp_ID    Names  Age    Salary        Destination  Bonus(10%)
0  25-Alien-001   Shuban   19  300000.0        ML Engineer     25000.0
1  25-Alien-002  Taimoor   20  240000.0                CEO     20000.0
2  25-Alien-003  Huzaifa   18  120000.0                COO     10000.0
3  25-Alien-004    Hadia   21  144000.0  Software Engineer      8000.0
4  25-Alien-005      Ali   22  108000.0         Full Stack      9000.0
5  25-Alien-006   Muneeb   20  120000.0         Full Stack     10000.0
6  25-Alien-007     Tuba   21   60000.0         Accountant      5000.0
7  25-Alien-008    Warda   22   72000.0      Human Resouce      6000.0
8  26-Alien-009    Hamna   22   95000.0            Finance      9500.0
9  26-Alien-010     Amna   22   90000.0            Finance      9500.0

In [11]:
## Adding New row
df.loc[len(df)] = ["26-Alien-011", "Salman", 22, 85000, "Marketing", 8500]
print(df)

          Emp_ID    Names  Age    Salary        Destination  Bonus(10%)
0   25-Alien-001   Shuban   19  300000.0        ML Engineer     25000.0
1   25-Alien-002  Taimoor   20  240000.0                CEO     20000.0
2   25-Alien-003  Huzaifa   18  120000.0                COO     10000.0
3   25-Alien-004    Hadia   21  144000.0  Software Engineer      8000.0
4   25-Alien-005      Ali   22  108000.0         Full Stack      9000.0
5   25-Alien-006   Muneeb   20  120000.0         Full Stack     10000.0
6   25-Alien-007     Tuba   21   60000.0         Accountant      5000.0
7   25-Alien-008    Warda   22   72000.0      Human Resouce      6000.0
8   26-Alien-009    Hamna   22   95000.0            Finance      9500.0
9   26-Alien-010     Amna   22   90000.0            Finance      9500.0
10  26-Alien-011   Salman   22   85000.0          Marketing      8500.0

In [12]:
## Remove Salman
df.drop(df[df["Names"] == "Salman"].index, inplace=True)
print(df)

         Emp_ID    Names  Age    Salary        Destination  Bonus(10%)
0  25-Alien-001   Shuban   19  300000.0        ML Engineer     25000.0
1  25-Alien-002  Taimoor   20  240000.0                CEO     20000.0
2  25-Alien-003  Huzaifa   18  120000.0                COO     10000.0
3  25-Alien-004    Hadia   21  144000.0  Software Engineer      8000.0
4  25-Alien-005      Ali   22  108000.0         Full Stack      9000.0
5  25-Alien-006   Muneeb   20  120000.0         Full Stack     10000.0
6  25-Alien-007     Tuba   21   60000.0         Accountant      5000.0
7  25-Alien-008    Warda   22   72000.0      Human Resouce      6000.0
8  26-Alien-009    Hamna   22   95000.0            Finance      9500.0
9  26-Alien-010     Amna   22   90000.0            Finance      9500.0

## Missing Data
* NaN (Not a number)
* None ( for object data type)
* isnull() : True -> NaN is missing | False -> value is present

In [60]:
data_miss = {
    "Names" : ['Shuban', 'Taimoor', 'Huzaifa', 'Hadia', 'Ali', 'Muneeb', 'Tuba', 'Warda', 'Hamna'],
    "Age" : [19,20,18,21,22,20, 21, 22, None],
    "Salary" : [250000, 200000, 100000, 80000, 90000, 100000, 50000, 60000, None],
    "Performance" : [99,95,85,80,85,90,70,75, None]
}

In [61]:
d = p.DataFrame(data_miss)

In [62]:
print(d.isnull())

   Names    Age  Salary  Performance
0  False  False   False        False
1  False  False   False        False
2  False  False   False        False
3  False  False   False        False
4  False  False   False        False
5  False  False   False        False
6  False  False   False        False
7  False  False   False        False
8  False   True    True         True

In [63]:
print(d.isnull().sum())

Names          0
Age            1
Salary         1
Performance    1
dtype: int64

## Handle Missing Data

* Drop missing data

In [64]:
# drop row or col
# d.dropna(axis=0, inplace=True) # rows -> axis 0

In [65]:
print(d)

     Names   Age    Salary  Performance
0   Shuban  19.0  250000.0         99.0
1  Taimoor  20.0  200000.0         95.0
2  Huzaifa  18.0  100000.0         85.0
3    Hadia  21.0   80000.0         80.0
4      Ali  22.0   90000.0         85.0
5   Muneeb  20.0  100000.0         90.0
6     Tuba  21.0   50000.0         70.0
7    Warda  22.0   60000.0         75.0
8    Hamna   NaN       NaN          NaN

* Replace with value

In [66]:
#defult value
# d.fillna(0, inplace=True)
print(d)

     Names   Age    Salary  Performance
0   Shuban  19.0  250000.0         99.0
1  Taimoor  20.0  200000.0         95.0
2  Huzaifa  18.0  100000.0         85.0
3    Hadia  21.0   80000.0         80.0
4      Ali  22.0   90000.0         85.0
5   Muneeb  20.0  100000.0         90.0
6     Tuba  21.0   50000.0         70.0
7    Warda  22.0   60000.0         75.0
8    Hamna   NaN       NaN          NaN

In [67]:
# # FIll with calculted values
# d['Age'] = d['Age'].fillna(d['Age'].mean())
# d['Salary'] = d['Salary'].fillna(d['Salary'].mean())
# d['Performance'] = d['Performance'].fillna(d['Performance'].mean())

In [68]:
print(d)

     Names   Age    Salary  Performance
0   Shuban  19.0  250000.0         99.0
1  Taimoor  20.0  200000.0         95.0
2  Huzaifa  18.0  100000.0         85.0
3    Hadia  21.0   80000.0         80.0
4      Ali  22.0   90000.0         85.0
5   Muneeb  20.0  100000.0         90.0
6     Tuba  21.0   50000.0         70.0
7    Warda  22.0   60000.0         75.0
8    Hamna   NaN       NaN          NaN

# intercolation
* fill estimated value
* Preserve data integrity
* avoid data loss
* smooth trend

In [69]:
d.interpolate(method="linear", axis=0, inplace=True)

C:\Users\Office\AppData\Local\Temp\ipykernel_7716\3866262860.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  d.interpolate(method="linear", axis=0, inplace=True)

In [70]:
print(d)

     Names   Age    Salary  Performance
0   Shuban  19.0  250000.0         99.0
1  Taimoor  20.0  200000.0         95.0
2  Huzaifa  18.0  100000.0         85.0
3    Hadia  21.0   80000.0         80.0
4      Ali  22.0   90000.0         85.0
5   Muneeb  20.0  100000.0         90.0
6     Tuba  21.0   50000.0         70.0
7    Warda  22.0   60000.0         75.0
8    Hamna  22.0   60000.0         75.0

In [71]:
## Adding New row
d.loc[len(d)] = ["Amna", 20, None, None]
print(d)

     Names   Age    Salary  Performance
0   Shuban  19.0  250000.0         99.0
1  Taimoor  20.0  200000.0         95.0
2  Huzaifa  18.0  100000.0         85.0
3    Hadia  21.0   80000.0         80.0
4      Ali  22.0   90000.0         85.0
5   Muneeb  20.0  100000.0         90.0
6     Tuba  21.0   50000.0         70.0
7    Warda  22.0   60000.0         75.0
8    Hamna  22.0   60000.0         75.0
9     Amna  20.0       NaN          NaN

C:\Users\Office\AppData\Local\Temp\ipykernel_7716\1445870947.py:2: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  d.loc[len(d)] = ["Amna", 20, None, None]

In [72]:
## Adding New row
d.loc[len(d)] = ["Muqaddas", 22, 50000, 80]
print(d)

       Names   Age    Salary  Performance
0     Shuban  19.0  250000.0         99.0
1    Taimoor  20.0  200000.0         95.0
2    Huzaifa  18.0  100000.0         85.0
3      Hadia  21.0   80000.0         80.0
4        Ali  22.0   90000.0         85.0
5     Muneeb  20.0  100000.0         90.0
6       Tuba  21.0   50000.0         70.0
7      Warda  22.0   60000.0         75.0
8      Hamna  22.0   60000.0         75.0
9       Amna  20.0       NaN          NaN
10  Muqaddas  22.0   50000.0         80.0